loadtesting/test-rapport.txt
TEST 1: 10000

time="2024-02-19T06:37:24Z" level=warning msg="Request Failed" error="Get \"http://nginx-service.loadtesting.svc.cluster.local:80/articles\": EOF"
time="2024-02-19T06:37:24Z" level=warning msg="Request Failed" error="Get \"http://nginx-service.loadtesting.svc.cluster.local:80/articles\": EOF"
time="2024-02-19T06:37:24Z" level=warning msg="Request Failed" error="Get \"http://nginx-service.loadtesting.svc.cluster.local:80/articles\": EOF"
time="2024-02-19T06:37:25Z" level=warning msg="Request Failed" error="Get \"http://nginx-service.loadtesting.svc.cluster.local:80/articles\": read tcp 10.2.0.174:41612->10.3.225.146:80: read: connection reset by peer"
time="2024-02-19T06:37:25Z" level=warning msg="Request Failed" error="Get \"http://nginx-service.loadtesting.svc.cluster.local:80/articles\": EOF"
time="2024-02-19T06:37:25Z" level=warning msg="Request Failed" error="Get \"http://nginx-service.loadtesting.svc.cluster.local:80/articles\": EOF"
time="2024-02-19T06:37:27Z" level=warning msg="Request Failed" error="Get \"http://nginx-service.loadtesting.svc.cluster.local:80/articles\": EOF"

     data_received..................: 92 MB  1.5 MB/s
     data_sent......................: 487 kB 8.1 kB/s
     http_req_blocked...............: avg=327.93ms min=1.55µs   med=159.32ms max=4.31s    p(90)=520.24ms p(95)=2.16s   
     http_req_connecting............: avg=217.6ms  min=0s       med=151.39ms max=2.14s    p(90)=397.85ms p(95)=903.82ms
     http_req_duration..............: avg=129.97ms min=0s       med=507.35µs max=29.63s   p(90)=54.23ms  p(95)=171.03ms
       { expected_response:true }...: avg=13.95s   min=880.57ms med=14.75s   max=29.63s   p(90)=23.92s   p(95)=24.65s  
     http_req_failed................: 99.25% ✓ 171194      ✗ 1282   
     http_req_receiving.............: avg=166.63µs min=0s       med=0s       max=632.56ms p(90)=0s       p(95)=0s      
     http_req_sending...............: avg=24.93ms  min=0s       med=379µs    max=1.06s    p(90)=40.74ms  p(95)=142.86ms
     http_req_tls_handshaking.......: avg=0s       min=0s       med=0s       max=0s       p(90)=0s       p(95)=0s      
     http_req_waiting...............: avg=104.87ms min=0s       med=7.67µs   max=29.63s   p(90)=19.11µs  p(95)=34.72µs 
     http_reqs......................: 172476 2873.758327/s
     iteration_duration.............: avg=3.44s    min=103.24ms med=3.32s    max=50.12s   p(90)=5.16s    p(95)=5.68s   
     iterations.....................: 86090  1434.413219/s
     vus............................: 300    min=0         max=10000
     vus_max........................: 10000  min=4303      max=10000


TEST 2: 10000

time="2024-02-19T07:11:46Z" level=warning msg="Request Failed" error="Get \"http://nginx-service.loadtesting.svc.cluster.local:80/articles\": EOF"
time="2024-02-19T07:11:46Z" level=warning msg="Request Failed" error="Get \"http://nginx-service.loadtesting.svc.cluster.local:80/articles\": EOF"
time="2024-02-19T07:11:46Z" level=warning msg="Request Failed" error="Get \"http://nginx-service.loadtesting.svc.cluster.local:80/articles\": EOF"
[...]

     data_received..................: 53 MB  876 kB/s
     data_sent......................: 347 kB 5.8 kB/s
     http_req_blocked...............: avg=345.79ms min=108.35µs med=160.61ms max=3.06s  p(90)=852.45ms p(95)=1.93s   
     http_req_connecting............: avg=249.85ms min=0s       med=154.16ms max=1.94s  p(90)=702.98ms p(95)=794.46ms
     http_req_duration..............: avg=94.49ms  min=0s       med=425.14µs max=52.92s p(90)=55.83ms  p(95)=207.44ms
       { expected_response:true }...: avg=27.62s   min=21.65s   med=22.69s   max=52.92s p(90)=43.32s   p(95)=49.43s  
     http_req_failed................: 99.79% ✓ 147621      ✗ 308    
     http_req_receiving.............: avg=2.8ms    min=0s       med=0s       max=8.57s  p(90)=0s       p(95)=0s      
     http_req_sending...............: avg=35.3ms   min=0s       med=365.53µs max=1.75s  p(90)=49.46ms  p(95)=182.54ms
     http_req_tls_handshaking.......: avg=0s       min=0s       med=0s       max=0s     p(90)=0s       p(95)=0s      
     http_req_waiting...............: avg=56.38ms  min=0s       med=7.55µs   max=49.31s p(90)=19.41µs  p(95)=32.84µs 
     http_reqs......................: 147929 2464.066855/s
     iteration_duration.............: avg=3.81s    min=1s       med=3.62s    max=57.01s p(90)=5.72s    p(95)=6.24s   
     iterations.....................: 73773  1228.843594/s
     vus............................: 412    min=0         max=10000
     vus_max........................: 10000  min=6120      max=10000


TEST 3: 10000 nginx 2 replicas


     data_received..................: 92 MB  1.5 MB/s
     data_sent......................: 532 kB 8.9 kB/s
     http_req_blocked...............: avg=324.62ms min=1.56µs   med=191.09ms max=3.1s   p(90)=591.46ms p(95)=1.81s   
     http_req_connecting............: avg=263.46ms min=0s       med=182.68ms max=2.09s  p(90)=580.87ms p(95)=895.57ms
     http_req_duration..............: avg=94.96ms  min=0s       med=340.11µs max=56.86s p(90)=62.91ms  p(95)=230.5ms 
       { expected_response:true }...: avg=12.19s   min=300.09ms med=5.78s    max=55.27s p(90)=37.77s   p(95)=46.51s  
     http_req_failed................: 99.60% ✓ 159863      ✗ 641    
     http_req_receiving.............: avg=819.77µs min=0s       med=0s       max=3.94s  p(90)=0s       p(95)=0s      
     http_req_sending...............: avg=30.54ms  min=0s       med=204.44µs max=1.19s  p(90)=50.49ms  p(95)=195.89ms
     http_req_tls_handshaking.......: avg=0s       min=0s       med=0s       max=0s     p(90)=0s       p(95)=0s      
     http_req_waiting...............: avg=63.6ms   min=0s       med=7.65µs   max=56.85s p(90)=20.02µs  p(95)=43.77µs 
     http_reqs......................: 160504 2672.475396/s
     iteration_duration.............: avg=3.41s    min=1s       med=3.18s    max=59.23s p(90)=5.12s    p(95)=5.83s   
     iterations.....................: 79831  1329.227828/s
     vus............................: 919    min=0         max=10000
     vus_max........................: 10000  min=5962      max=10000

TEST 4: 10000 nginx 2 node: 2

     data_received..................: 186 MB 3.1 MB/s
     data_sent......................: 323 kB 5.4 kB/s
     http_req_blocked...............: avg=437.48ms min=146µs    med=297.52ms max=3.39s  p(90)=1.01s    p(95)=1.34s   
     http_req_connecting............: avg=377.77ms min=105.41µs med=258.95ms max=3s     p(90)=848.15ms p(95)=1.02s   
     http_req_duration..............: avg=104.51ms min=0s       med=658.27µs max=56.02s p(90)=85.63ms  p(95)=264.3ms 
       { expected_response:true }...: avg=29.55s   min=939.37ms med=30.5s    max=56.02s p(90)=51.09s   p(95)=53.1s   
     http_req_failed................: 99.80% ✓ 155767      ✗ 299    
     http_req_receiving.............: avg=3.99ms   min=0s       med=0s       max=12.34s p(90)=0s       p(95)=0s      
     http_req_sending...............: avg=46.18ms  min=0s       med=556.51µs max=2.4s   p(90)=71.24ms  p(95)=239.69ms
     http_req_tls_handshaking.......: avg=0s       min=0s       med=0s       max=0s     p(90)=0s       p(95)=0s      
     http_req_waiting...............: avg=54.33ms  min=0s       med=7.77µs   max=55.4s  p(90)=21.7µs   p(95)=39.99µs 
     http_reqs......................: 156066 2599.032421/s
     iteration_duration.............: avg=3.69s    min=1s       med=3.58s    max=58.98s p(90)=5.37s    p(95)=5.7s    
     iterations.....................: 77643  1293.021377/s
     vus............................: 834    min=0         max=10000
     vus_max........................: 10000  min=5659      max=10000

TEST 4: 10000 nginx 2 node: 5

time="2024-02-19T07:33:19Z" level=warning msg="Request Failed" error="Get \"http://nginx-service.loadtesting.svc.cluster.local:80/articles\": EOF"
time="2024-02-19T07:33:19Z" level=warning msg="Request Failed" error="Get \"http://nginx-service.loadtesting.svc.cluster.local:80/articles\": EOF"

     data_received..................: 517 MB 8.6 MB/s
     data_sent......................: 1.1 MB 18 kB/s
     http_req_blocked...............: avg=376.54ms min=1.75µs   med=232.78ms max=3.08s  p(90)=891.21ms p(95)=1.36s   
     http_req_connecting............: avg=337.19ms min=0s       med=223.48ms max=2.54s  p(90)=859.82ms p(95)=939.35ms
     http_req_duration..............: avg=242.24ms min=0s       med=1.13ms   max=56.86s p(90)=74.2ms   p(95)=318.78ms
       { expected_response:true }...: avg=23.86s   min=439.62ms med=23.72s   max=56.86s p(90)=46.86s   p(95)=51.28s  
     http_req_failed................: 99.14% ✓ 132578      ✗ 1147   
     http_req_receiving.............: avg=12.09ms  min=0s       med=0s       max=13.14s p(90)=0s       p(95)=0s      
     http_req_sending...............: avg=33.75ms  min=0s       med=581.39µs max=1.32s  p(90)=47.34ms  p(95)=200.98ms
     http_req_tls_handshaking.......: avg=0s       min=0s       med=0s       max=0s     p(90)=0s       p(95)=0s      
     http_req_waiting...............: avg=196.38ms min=0s       med=8.13µs   max=56.25s p(90)=26.36µs  p(95)=5.62ms  
     http_reqs......................: 133725 2227.147303/s
     iteration_duration.............: avg=4.42s    min=1s       med=4.01s    max=59.01s p(90)=6.3s     p(95)=6.95s   
     iterations.....................: 66593  1109.085215/s
     vus............................: 663    min=0         max=10000
     vus_max........................: 10000  min=4972      max=10000